Repository: felsocim/Slovoca
Catalog: Properties/Resources.*.resx
Languages: sk

# ABOUT_BOX_GNU
source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.
sk: Tento program je slobodný softvér: môžete ho šíriť a upravovať podľa ustanovení Všeobecnej verejnej licencie GNU (GNU General Public Licence), vydávanej nadáciou Free Software Foundation a to buď podľa 2. verzie tejto Licencie, alebo ktorejkoľvek neskoršej verzie. Tento program je rozširovaný v nádeji, že bude užitočný, avšak BEZ AKEJKOĽVEK ZÁRUKY. Neposkytujú sa ani odvodené záruky PREDAJNOSTI alebo VHODNOSTI PRE URČITÝ ÚČEL. Ďalšie podrobnosti hľadajte vo Všeobecnej verejnej licencii GNU. Kópiu Všeobecnej verejnej licencie GNU ste mali dostať spolu s týmto programom. Ak sa tak nestalo, napíšte na adresu Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.

# ABOUT_BOX_TITLE_PREFIX
source: About
sk: O programe

# ABOUT_BOX_VERSION_PREFIX
source: Version
sk: Vydanie

# MAIN_WINDOW_ENTRIES_IN_PREFIX
source: Entries in
sk: Heslá v jazyku

# MAIN_WINDOW_ENTRY_ALREADY_EXISTS_CAPTION
source: Entry already exists
sk: Heslo už jestvuje

# MAIN_WINDOW_ENTRY_ALREADY_EXISTS_MESSAGE_PREFIX
source: The entry:
sk: Heslo:

# MAIN_WINDOW_ENTRY_ALREADY_EXISTS_MESSAGE_SUFFIX
source: already exists in the selected vocabulary. Would you like to update it?
sk: sa už v slovníku nachádza. Chcete ho aktualizovať?

# MAIN_WINDOW_ENTRY_DISAPPEARED_CAPTION
source: Something went wrong
sk: Niečo sa pokazilo

# MAIN_WINDOW_ENTRY_DISAPPEARED_MESSAGE
source: The edited entry is no longer present in the target vocabulary!
sk: Upravované heslo sa už viac v slovníku nenachádza!

# MAIN_WINDOW_ENTRY_NOT_FOUND_CAPTION
source: Entry not found
sk: Heslo sa nenašlo

# MAIN_WINDOW_ENTRY_NOT_FOUND_MESSAGE
source: Requested entry does not exist in the active vocabulary part.
sk: Požadované heslo sa v zvolenom smere slovníka nenašlo.

# MAIN_WINDOW_NOTHING_SELECTED_CAPTION
source: No entry selected
sk: Žiadne zvolené heslo

# MAIN_WINDOW_NOTHING_SELECTED_MESSAGE
source: Please, select an entry first!
sk: Prosím, najskôr zvoľte nejaké heslo!

# MAIN_WINDOW_PROJECT_SAVE_FAILURE_CAPTION
source: Save failure
sk: Uloženie zlyhalo

# MAIN_WINDOW_PROJECT_SAVE_FAILURE_PREFIX
source: Failed to save the project to file:
sk: Nepodarilo sa uložiť súbor projektu:

# MAIN_WINDOW_UNSAVED_CHANGES_CAPTION
source: Unsaved changes
sk: Neuložené zmeny

# MAIN_WINDOW_UNSAVED_CHANGES_MESSAGE
source: There are unsaved changes in your project. Do you want to save them first?
sk: Váš projekt obsahuje neuložené zmeny. Chcete ich najprv uložiť?

# MAIN_WINDOW_UNSAVED_CHANGES_TAG
source: (unsaved changes)
sk: (neuložené zmeny)

# NEW_ENTRY_DIALOG_ADD_BUTTON
source: Add
sk: Pridať

# NEW_ENTRY_DIALOG_ADD_TITLE
source: Add entry
sk: Pridať heslo

# NEW_ENTRY_DIALOG_EDIT_BUTTON
source: Save
sk: Uložiť

# NEW_ENTRY_DIALOG_EDIT_TITLE
source: Edit entry
sk: Upraviť heslo

# NEW_ENTRY_DIALOG_MISSING_DATA_CAPTION
source: Missing data
sk: Chýbajúce údaje

# NEW_ENTRY_DIALOG_MISSING_ENTRY_MEANING
source: Please, type in the meaning of the entry!
sk: Prosím, zadajte význam hesla!

# NEW_ENTRY_DIALOG_MISSING_TRANSLATION
source: Please, type in at least one translation of the entry!
sk: Prosím, zadajte aspoň jeden preklad hesla!

# NEW_PROJECT_DIALOG_UNSPECIFIED_CAPTION
source: Missing data
sk: Chýbajúce údaje

# NEW_PROJECT_DIALOG_UNSPECIFIED_FOREIGN_CULTURE
source: Please, choose a foreign language culture of your new vocabulary!
sk: Prosím, zvoľte cudzí jazyk vášho nového slovníka!

# NEW_PROJECT_DIALOG_UNSPECIFIED_LOCATION
source: Please, choose location and name for your new project file!
sk: Prosím, zvoľte umiestnenie a názov vášho nového súboru projektu!

# NEW_PROJECT_DIALOG_UNSPECIFIED_NATIVE_CULTURE
source: Please, choose a native language culture of your new vocabulary!
sk: Prosím, zvoľte rodný jazyk vášho nového slovníka!

# ABOUT_BOX_DESCRIPTION
source: Personalized vocabulary creation tool
sk: Nástroj na tvorbu vlastných slovníkov

# MAIN_WINDOW_PROJECT_LOAD_FAILURE_CAPTION
source: Load failure
sk: Načítanie zlyhalo

# MAIN_WINDOW_PROJECT_LOAD_FAILURE_MESSAGE
source: Failed to load the contents of the requested project file!
sk: Nepodarilo sa načítať obsah požadovaného súboru projektu!
